Repository: dutkaD/flutter_signin_signup
Catalog: lib/l10n/app_*.arb
Languages: uk

# nameFormLabel
source: Name
uk: Ім`я

# passwordFormLabel
source: Password
uk: Пароль

# signInButtonLabel
source: Sign in
uk: Увійти

# signUpButtonLabel
source: Register
uk: Створити аккаунт

# createUserLinkLabel
source: Create a new user
uk: Створити новий аккаунт

# alreadeHaveAccountLinkLabel
source: I already have an account
uk: У меня вже є аккаунт

# signInHeader
source: Sing in
uk: Увійти

# createNewUserHeader
source: Create a new user
uk: Створити новий аккаунт

# emailMalformedError
source: This email address is invalid
uk: Неправильна email адреса

# passwordNotGoodError
source: Password should be longer than 6 characters
uk: Пароль має бути не менше 6 знаків

# passwordCantBeEmptyError
source: Password can''t be empty
uk: Введіть пароль

# emailCantBeEmptyError
source: Email can't be empty
uk: Email адреса не може бути пустою

# nameCantBeEmptyError
source: Name can't be empty
uk: Ім`я не може бути пустим

# dashboardScoreLabel
source: My score
uk: Mої бали

# dashboardSeeScoreHistory
source: see history
uk: більше

# quoteNoTreatsYet
source: Seems like you haven't planned any treats yet. Anything you would want to do more often?
uk: Здається, ви ще не запланували чим себе побалувати?

# randomQuestionHowAreYou
source: How are you doing today?
uk: Як у тебе справи сьогодні?

# answerGood
source: GOOD
uk: Добре

# answerOk
source: OK
uk: Більш-менш

# answerUgh
source: Ugh
uk: Кепсько

source: Recent treats
uk: Останні забаганки

# treatsMonthlyLabel
source: Monthly treats
uk: Балувати себе чимось раз на місяць

# treatsMonthlyLetsAdd
source: Let's add a monthly treat
uk: Додамо-но щось хороше?

# treatsYearlyLabel
source: Yearly treats
uk: Балувати себе чимось раз на рік

# treatsYearlyLetsAdd
source: Let's add a yearly treat
uk: Додамо-но щось хороше?
